Revit 2026 API

# CompoundStructureGetSegmentOrientation Method

---

Gets the orientation of a segment.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RectangularGridSegmentOrientation GetSegmentOrientation(
	int segmentId
)
```
```vb
Public Function GetSegmentOrientation (
	segmentId As Integer
) As RectangularGridSegmentOrientation
```
```cpp
public:
RectangularGridSegmentOrientation GetSegmentOrientation(
	int segmentId
)
```
```fsharp
member GetSegmentOrientation :
        segmentId : int -> RectangularGridSegmentOrientation
```

#### Parameters

segmentId Int32
     The id of a segment in this CompoundStructure.

#### Return Value

RectangularGridSegmentOrientation The orientation of the specified segment.

| Exception | Condition |
| --- | --- |
| ArgumentException | The segment id is invalid. |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

The boundaries of the regions of a vertically compound structure consist of vertical horizontal segments.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace